#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	// & (AND)
	int a1 = 5;  //0000101ฒนย๋
	int b1 = -7; //1000111ิญย๋ 1111000ทดย๋ 1111001ฒนย๋
	int c1 = a1 & b1; //ฒนย๋0000001 (1)
	printf("c1=%d\n", c1);

	// | (OR)
	int a2 = 5;  //0000101ฒนย๋
	int b2 = -7; //1000111ิญย๋ 1111000ทดย๋ 1111001ฒนย๋
	int c2 = a2 | b2; //ฒนย๋1111100 ทดย๋1111100 ิญย๋1000011 (-3)
	printf("c2=%d\n", c2);

	// ^ (XOR)
	int a3 = 5;  //0000101ฒนย๋
	int b3 = -7; //1000111ิญย๋ 1111000ทดย๋ 1111001ฒนย๋
	int c3 = a3 ^ b3; //ฒนย๋1111100 ทดย๋1111011 ิญย๋1000100 (-4) 
	printf("c3=%d\n", c3);







	return 0;
}